/**
 * 1. grammar  :  词法分析 (Token) + 语法解析 (IR)
 * 2. api      :  三方接口服务
 * 3. plugin   :  插件库
 * 3.1. 参数绑定插件
 * 3.2. 日志打印插件
 * 3.3. 异步调用插件
 * 3.4. 缓存调用插件
 * 3.5. 限流插件
 * 3.6. 重试插件
 * 3.7. 监控插件
 * 3.8. 校验插件
 * 3.9. 脱敏插件
 * 4. function :  函数库
 * 4.1. 基础函数库：转换函数、逻辑函数、结构函数、字符函数、访问函数、日期函数
 * 4.2. 数学函数库：数据函数封装、常用算法封装
 * 4.3. 网络函数库：同步调用、异步调用、文件上传、文件下载、请求监听、静态资源
 * 4.4. 数据函数库：数据库元信息管理、数据库表元信息管理、数据增、删、查、改函数
 * 4.5. 系统函数库：操作系统交互函数、操作系统监控函数
 * 5. interactive : 交互系统
 * 5.1. web 页面交互系统
 * 5.2. cli 命令交互系统
 * TODO :
 * 1. 单元测试
 * 2. 校验插件
 * 3. 网络函数库、数据函数库、系统函数库
 * 4. 功能文档
 * 5. 交互系统
 *
 * @author hongda.li
 */
package com.gitee.usl;